In [1]:
import numpy as np

In [3]:
import pandas as pd

In [24]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [25]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [26]:
df.head()# by default will show top 5 rows

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [27]:
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [28]:
df.tail(1)

   col1  col2 col3
3     4   444  xyz

In [29]:
df['col1'].unique()

array([1, 2, 3, 4])

In [30]:
df['col1'].nunique()

4

In [31]:
df['col3'].value_counts()

ghi    1
def    1
xyz    1
abc    1
Name: col3, dtype: int64

In [38]:
newdf = df[(df['col1']>2) & (df['col2'] == 444)]

In [39]:
#Function Apply

In [40]:
newdf

   col1  col2 col3
3     4   444  xyz

In [41]:
def time_2(n):
    return n*n

In [42]:
df['col1'].apply(time_2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [44]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [45]:
del df['col1']

In [46]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [49]:
df.rename({'col2':'max'},axis=1)

TypeError: rename() got an unexpected keyword argument "axis"

In [51]:
df.rename_axis({'col2':'max'},axis=1)

   max col3
0  444  abc
1  555  def
2  666  ghi
3  444  xyz

In [52]:
df.sort_values(by = 'col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [53]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [54]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [55]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [57]:
#custom table